RoboCupULaval/RobotMCU/Robot_stm32f4discovery/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define CS_I2C_SPI_Pin GPIO_PIN_3
#define CS_I2C_SPI_GPIO_Port GPIOE
#define ID_0_Pin GPIO_PIN_4
#define ID_0_GPIO_Port GPIOE
#define ID_1_Pin GPIO_PIN_5
#define ID_1_GPIO_Port GPIOE
#define ID_2_Pin GPIO_PIN_6
#define ID_2_GPIO_Port GPIOE
#define PH0_OSC_IN_Pin GPIO_PIN_0
#define PH0_OSC_IN_GPIO_Port GPIOH
#define PH1_OSC_OUT_Pin GPIO_PIN_1
#define PH1_OSC_OUT_GPIO_Port GPIOH
#define OTG_FS_PowerSwitchOn_Pin GPIO_PIN_0
#define OTG_FS_PowerSwitchOn_GPIO_Port GPIOC
#define NRF_CE_DELTA_Pin GPIO_PIN_1
#define NRF_CE_DELTA_GPIO_Port GPIOC
#define NRF_MISO_Pin GPIO_PIN_2
#define NRF_MISO_GPIO_Port GPIOC
#define NRF_IRQ_Pin GPIO_PIN_3
#define NRF_IRQ_GPIO_Port GPIOC
#define NRF_IRQ_EXTI_IRQn EXTI3_IRQn
#define MOTOR1_PWM_Pin GPIO_PIN_0
#define MOTOR1_PWM_GPIO_Port GPIOA
#define MOTOR2_ENCB_Pin GPIO_PIN_1
#define MOTOR2_ENCB_GPIO_Port GPIOA
#define MOTOR3_PWM_Pin GPIO_PIN_2
#define MOTOR3_PWM_GPIO_Port GPIOA
#define MOTOR4_PWM_Pin GPIO_PIN_3
#define MOTOR4_PWM_GPIO_Port GPIOA
#define MOTOR2_ENCA_Pin GPIO_PIN_5
#define MOTOR2_ENCA_GPIO_Port GPIOA
#define MOTOR3_ENCA_Pin GPIO_PIN_6
#define MOTOR3_ENCA_GPIO_Port GPIOA
#define MOTOR3_ENCB_Pin GPIO_PIN_7
#define MOTOR3_ENCB_GPIO_Port GPIOA
#define POSITION_SENSOR1_Pin GPIO_PIN_4
#define POSITION_SENSOR1_GPIO_Port GPIOC
#define POSITION_SENSOR2_Pin GPIO_PIN_5
#define POSITION_SENSOR2_GPIO_Port GPIOC
#define MOTOR3_DIR_Pin GPIO_PIN_0
#define MOTOR3_DIR_GPIO_Port GPIOB
#define BOOT1_Pin GPIO_PIN_2
#define BOOT1_GPIO_Port GPIOB
#define IMU_IRQ_Pin GPIO_PIN_8
#define IMU_IRQ_GPIO_Port GPIOE
#define MOTOR1_ENCA_Pin GPIO_PIN_9
#define MOTOR1_ENCA_GPIO_Port GPIOE
#define MOTOR1_ENCB_Pin GPIO_PIN_11
#define MOTOR1_ENCB_GPIO_Port GPIOE
#define MOTOR1_DIR_Pin GPIO_PIN_13
#define MOTOR1_DIR_GPIO_Port GPIOE
#define MOTOR2_DIR_Pin GPIO_PIN_15
#define MOTOR2_DIR_GPIO_Port GPIOE
#define NRF_CS_Pin GPIO_PIN_12
#define NRF_CS_GPIO_Port GPIOB
#define NRF_SCK_Pin GPIO_PIN_13
#define NRF_SCK_GPIO_Port GPIOB
#define DRIBBLER_PWM_Pin GPIO_PIN_14
#define DRIBBLER_PWM_GPIO_Port GPIOB
#define NRF_MOSI_Pin GPIO_PIN_15
#define NRF_MOSI_GPIO_Port GPIOB
#define BANK_FULL_Pin GPIO_PIN_8
#define BANK_FULL_GPIO_Port GPIOD
#define CHARGE_BANK_Pin GPIO_PIN_9
#define CHARGE_BANK_GPIO_Port GPIOD
#define KICK_Pin GPIO_PIN_10
#define KICK_GPIO_Port GPIOD
#define KICKER_SELECT_Pin GPIO_PIN_11
#define KICKER_SELECT_GPIO_Port GPIOD
#define LD4_GPIO5_Pin GPIO_PIN_12
#define LD4_GPIO5_GPIO_Port GPIOD
#define LD3_GPIO4_Pin GPIO_PIN_13
#define LD3_GPIO4_GPIO_Port GPIOD
#define LD5_GPIO3_Pin GPIO_PIN_14
#define LD5_GPIO3_GPIO_Port GPIOD
#define LD6_GPIO2_Pin GPIO_PIN_15
#define LD6_GPIO2_GPIO_Port GPIOD
#define NRF_CE_GAMMA_Pin GPIO_PIN_6
#define NRF_CE_GAMMA_GPIO_Port GPIOC
#define EN_POWER_Pin GPIO_PIN_7
#define EN_POWER_GPIO_Port GPIOC
#define MOTOR2_PWM_Pin GPIO_PIN_8
#define MOTOR2_PWM_GPIO_Port GPIOC
#define SWITCH_INPUT_Pin GPIO_PIN_9
#define SWITCH_INPUT_GPIO_Port GPIOC
#define DEBUG_SWITCH_Pin GPIO_PIN_8
#define DEBUG_SWITCH_GPIO_Port GPIOA
#define OTG_FS_DM_Pin GPIO_PIN_11
#define OTG_FS_DM_GPIO_Port GPIOA
#define OTG_FS_DP_Pin GPIO_PIN_12
#define OTG_FS_DP_GPIO_Port GPIOA
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
#define NRF_IRQC11_Pin GPIO_PIN_11
#define NRF_IRQC11_GPIO_Port GPIOC
#define NRF_IRQC11_EXTI_IRQn EXTI15_10_IRQn
#define Audio_RST_Pin GPIO_PIN_4
#define Audio_RST_GPIO_Port GPIOD
#define OTG_FS_OverCurrent_Pin GPIO_PIN_5
#define OTG_FS_OverCurrent_GPIO_Port GPIOD
#define MOTOR4_ENCA_Pin GPIO_PIN_6
#define MOTOR4_ENCA_GPIO_Port GPIOB
#define MOTOR4_ENCB_Pin GPIO_PIN_7
#define MOTOR4_ENCB_GPIO_Port GPIOB
#define MOTOR4_DIR_Pin GPIO_PIN_8
#define MOTOR4_DIR_GPIO_Port GPIOB
#define MEMS_INT2_Pin GPIO_PIN_1
#define MEMS_INT2_GPIO_Port GPIOE
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
